OpenNuvoton/Nano103BSP/Library/StdDriver/src/clk.c
    CLK_WaitClockReady(CLK_STATUS_PLLSTB_Msk);
    CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_PLL,CLK_HCLK_CLK_DIVIDER(1));
    return SystemCoreClock;
}

/**
  * @brief  This function set HCLK clock source and HCLK clock divider
  * @param[in]  u32ClkSrc is HCLK clock source. Including :
  *         - \ref CLK_CLKSEL0_HCLKSEL_HXT
  *         - \ref CLK_CLKSEL0_HCLKSEL_LXT
  *         - \ref CLK_CLKSEL0_HCLKSEL_PLL
  *         - \ref CLK_CLKSEL0_HCLKSEL_LIRC
  *         - \ref CLK_CLKSEL0_HCLKSEL_HIRC
  *         - \ref CLK_CLKSEL0_HCLKSEL_HIRC0
  *         - \ref CLK_CLKSEL0_HCLKSEL_HIRC1
  *         - \ref CLK_CLKSEL0_HCLKSEL_MIRC
  * @param[in]  u32ClkDiv is HCLK clock divider. Including :
  *         - \ref CLK_HCLK_CLK_DIVIDER(x)
  * @return None
  */
void CLK_SetHCLK(uint32_t u32ClkSrc, uint32_t u32ClkDiv)
{
    CLK->CLKDIV0 = (CLK->CLKDIV0 & ~CLK_CLKDIV0_HCLKDIV_Msk) | u32ClkDiv;
    CLK->CLKSEL0 = (CLK->CLKSEL0 & ~(CLK_CLKSEL0_HIRCSEL_Msk | CLK_CLKSEL0_HCLKSEL_Msk)) | u32ClkSrc;
    SystemCoreClockUpdate();
}

/**
  * @brief  This function set APB PCLK0 clock divider
  * @param[in]  u32ClkDiv is PCLK0 clock divider. Including :
  *         - \ref CLK_APB0DIV_HCLK
  *         - \ref CLK_APB0DIV_1_2HCLK
  *         - \ref CLK_APB0DIV_1_4HCLK
  *         - \ref CLK_APB0DIV_1_8HCLK
  *         - \ref CLK_APB0DIV_1_16HCLK
  * @return None
  */
void CLK_SetPCLK0(uint32_t u32ClkDiv)
{
    CLK->APBDIV = (CLK->APBDIV & ~CLK_APBDIV_APB0DIV_Msk) | u32ClkDiv;
}

/**
  * @brief  This function set APB PCLK1 clock divider
  * @param[in]  u32ClkDiv is PCLK1 clock divider. Including :
  *         - \ref CLK_APB1DIV_HCLK
  *         - \ref CLK_APB1DIV_1_2HCLK
  *         - \ref CLK_APB1DIV_1_4HCLK
  *         - \ref CLK_APB1DIV_1_8HCLK
  *         - \ref CLK_APB1DIV_1_16HCLK
  * @return None
  */
void CLK_SetPCLK1(uint32_t u32ClkDiv)
{
    CLK->APBDIV = (CLK->APBDIV & ~CLK_APBDIV_APB1DIV_Msk) | u32ClkDiv;
}

/**
  * @brief  This function set selected module clock source and module clock divider
  * @param[in]  u32ModuleIdx is module index.
  * @param[in]  u32ClkSrc is module clock source.
  * @param[in]  u32ClkDiv is module clock divider.
  * @return None
  * @details Valid parameter combinations listed in following table:
  *-
  * |Module index         |Clock source                            |Divider                                 |
  * | :------------------ | :------------------------------------  | :------------------------------------  |
  * |\ref ISP_MODULE      |\ref CLK_CLKSEL0_ISPSEL_HIRC            | x                                      |
  * |\ref ISP_MODULE      |\ref CLK_CLKSEL0_ISPSEL_MIRC            | x                                      |
  * |\ref UART0_MODULE    |\ref CLK_CLKSEL1_UART0SEL_HXT           |\ref CLK_UART0_CLK_DIVIDER(x)           |
  * |\ref UART0_MODULE    |\ref CLK_CLKSEL1_UART0SEL_LXT           |\ref CLK_UART0_CLK_DIVIDER(x)           |
  * |\ref UART0_MODULE    |\ref CLK_CLKSEL1_UART0SEL_PLL           |\ref CLK_UART0_CLK_DIVIDER(x)           |
  * |\ref UART0_MODULE    |\ref CLK_CLKSEL1_UART0SEL_HIRC          |\ref CLK_UART0_CLK_DIVIDER(x)           |
  * |\ref UART0_MODULE    |\ref CLK_CLKSEL1_UART0SEL_MIRC          |\ref CLK_UART0_CLK_DIVIDER(x)           |
  * |\ref PWM0_MODULE     |\ref CLK_CLKSEL1_PWM0SEL_PLL            | x                                      |
  * |\ref PWM0_MODULE     |\ref CLK_CLKSEL1_PWM0SEL_PCLK0          | x                                      |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_HXT            |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_LXT            |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_LIRC           |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_HIRC           |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_MIRC           |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR0_MODULE     |\ref CLK_CLKSEL1_TMR0SEL_EXT            |\ref CLK_TMR0_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_HXT            |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_LXT            |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_LIRC           |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_HIRC           |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_MIRC           |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref TMR1_MODULE     |\ref CLK_CLKSEL1_TMR1SEL_EXT            |\ref CLK_TMR1_CLK_DIVIDER(x)            |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_HXT             |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_LXT             |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_PLL             |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_HIRC            |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_MIRC            |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref ADC_MODULE      |\ref CLK_CLKSEL1_ADCSEL_HCLK            |\ref CLK_ADC_CLK_DIVIDER(x)             |
  * |\ref SPI0_MODULE     |\ref CLK_CLKSEL1_SPI0SEL_HXT            | x                                      |
  * |\ref SPI0_MODULE     |\ref CLK_CLKSEL1_SPI0SEL_PLL            | x                                      |
  * |\ref SPI0_MODULE     |\ref CLK_CLKSEL1_SPI0SEL_HIRC           | x                                      |
  * |\ref SPI0_MODULE     |\ref CLK_CLKSEL1_SPI0SEL_HCLK           | x                                      |
  * |\ref SPI2_MODULE     |\ref CLK_CLKSEL1_SPI2SEL_HXT            | x                                      |
  * |\ref SPI2_MODULE     |\ref CLK_CLKSEL1_SPI2SEL_PLL            | x                                      |
  * |\ref SPI2_MODULE     |\ref CLK_CLKSEL1_SPI2SEL_HIRC           | x                                      |
  * |\ref SPI2_MODULE     |\ref CLK_CLKSEL1_SPI2SEL_HCLK           | x                                      |
  * |\ref WDT_MODULE      |\ref CLK_CLKSEL1_WDTSEL_LXT             | x                                      |
  * |\ref WDT_MODULE      |\ref CLK_CLKSEL1_WDTSEL_LIRC            | x                                      |
  * |\ref WDT_MODULE      |\ref CLK_CLKSEL1_WDTSEL_HCLKDIV2048     | x                                      |
  * |\ref WWDT_MODULE     |\ref CLK_CLKSEL1_WWDTSEL_LIRC           | x                                      |
  * |\ref WWDT_MODULE     |\ref CLK_CLKSEL1_WWDTSEL_HCLKDIV2048    | x                                      |
  * |\ref UART1_MODULE    |\ref CLK_CLKSEL2_UART1SEL_HXT           |\ref CLK_UART1_CLK_DIVIDER(x)           |
  * |\ref UART1_MODULE    |\ref CLK_CLKSEL2_UART1SEL_LXT           |\ref CLK_UART1_CLK_DIVIDER(x)           |
  * |\ref UART1_MODULE    |\ref CLK_CLKSEL2_UART1SEL_PLL           |\ref CLK_UART1_CLK_DIVIDER(x)           |
  * |\ref UART1_MODULE    |\ref CLK_CLKSEL2_UART1SEL_HIRC          |\ref CLK_UART1_CLK_DIVIDER(x)           |
  * |\ref UART1_MODULE    |\ref CLK_CLKSEL2_UART1SEL_MIRC          |\ref CLK_UART1_CLK_DIVIDER(x)           |
  * |\ref CLKO_MODULE     |\ref CLK_CLKSEL2_CLKOSEL_HXT            | x                                      |
  * |\ref CLKO_MODULE     |\ref CLK_CLKSEL2_CLKOSEL_LXT            | x                                      |
  * |\ref CLKO_MODULE     |\ref CLK_CLKSEL2_CLKOSEL_HIRC           | x                                      |
  * |\ref CLKO_MODULE     |\ref CLK_CLKSEL2_CLKOSEL_HIRC           | x                                      |
  * |\ref CLKO_MODULE     |\ref CLK_CLKSEL2_CLKOSEL_HCLK           | x                                      |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_HXT            |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_LXT            |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_LIRC           |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_HIRC           |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_MIRC           |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR2_MODULE     |\ref CLK_CLKSEL2_TMR2SEL_EXT            |\ref CLK_TMR2_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_HXT            |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_LXT            |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_LIRC           |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_HIRC           |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_MIRC           |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref TMR3_MODULE     |\ref CLK_CLKSEL2_TMR3SEL_EXT            |\ref CLK_TMR3_CLK_DIVIDER(x)            |
  * |\ref SC0_MODULE      |\ref CLK_CLKSEL2_SC0SEL_HXT             |\ref CLK_SC0_CLK_DIVIDER(x)             |
  * |\ref SC0_MODULE      |\ref CLK_CLKSEL2_SC0SEL_PLL             |\ref CLK_SC0_CLK_DIVIDER(x)             |
  * |\ref SC0_MODULE      |\ref CLK_CLKSEL2_SC0SEL_HIRC            |\ref CLK_SC0_CLK_DIVIDER(x)             |
  * |\ref SC0_MODULE      |\ref CLK_CLKSEL2_SC0SEL_MIRC            |\ref CLK_SC0_CLK_DIVIDER(x)             |
  * |\ref SC0_MODULE      |\ref CLK_CLKSEL2_SC0SEL_HCLK            |\ref CLK_SC0_CLK_DIVIDER(x)             |
  * |\ref SPI1_MODULE     |\ref CLK_CLKSEL2_SPI1SEL_HXT            | x                                      |
  * |\ref SPI1_MODULE     |\ref CLK_CLKSEL2_SPI1SEL_PLL            | x                                      |
  * |\ref SPI1_MODULE     |\ref CLK_CLKSEL2_SPI1SEL_HIRC           | x                                      |
  * |\ref SPI1_MODULE     |\ref CLK_CLKSEL2_SPI1SEL_HCLK           | x                                      |
  * |\ref SPI3_MODULE     |\ref CLK_CLKSEL2_SPI3SEL_HXT            | x                                      |
  * |\ref SPI3_MODULE     |\ref CLK_CLKSEL2_SPI3SEL_PLL            | x                                      |
  * |\ref SPI3_MODULE     |\ref CLK_CLKSEL2_SPI3SEL_HIRC           | x                                      |
  * |\ref SPI3_MODULE     |\ref CLK_CLKSEL2_SPI3SEL_HCLK           | x                                      |
  */

